app/views/tasks/show.html.erb

SELECT "tasks".* FROM "tasks"
---

<% @task.task_assignments.each do |tskas| %>