app/controllers/tasks_controller.rb

  def index
    respond_with(@tasks = Task.all)
---
SELECT "tasks".* FROM "tasks"

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Something"], ["description", "Something to do"], ["created_at", "2015-08-12 17:49:22.813559"], ["updated_at", "2015-08-12 17:49:22.813559"]]

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["name", "Something1"], ["description", "Something to do1"], ["updated_at", "2015-08-12 17:49:32.577421"], ["id", 1]]